import { ProductParams } from '@/types/redux'
import { FaFacebook, FaInstagram, FaTiktok, FaYoutube } from 'react-icons/fa6'

export const home = {
	ethaps: {
		title: 'Етапи покупки',
		data: [
			{
				title: 'Вибір',
				text: 'У нашому магазині Ви можете знайти будь-які товари для дому або можете скористатись допомогою наших менеджерів',
			},
			{
				title: 'Узгодження з менеджером',
				text: 'Наші менеджери з радістю підкажуть  варіанти доставки і оплати саме для вас',
			},
			{
				title: 'Відправка',
				text: 'Після узгодження деталей з доставки і оплати наші працівники відправляють товар  в умовлений час',
			},
		],
	},
	advantages: {
		title: 'Чому нас обирають',
		data: [
			{
				title: 'Широкий асортимент',
				text: "Ми пропонуємо великий вибір меблів для будь-яких кімнат та стилів інтер'єру.",
				image: '/Advantages/Assortement.svg',
			},
			{
				title: 'Індивідуальний підхід',
				text: 'Ми завжди готові врахувати ваші побажання та створити меблі на замовлення.',
				image: '/Advantages/Individual.svg',
			},
			{
				title: 'Гарантія якості',
				text: 'Ми завжди готові врахувати ваші побажання та створити меблі на замовлення.',
				image: '/Advantages/Garanty.svg',
			},
			{
				title: 'Доступність',
				text: 'Ми прагнемо пропонувати конкурентоспроможні ціни без шкоди для якості.',
				image: '/Advantages/Availability.svg',
			},
			{
				title: 'Професійна консультація',
				text: 'Наші експерти завжди готові надати кваліфіковану допомогу у виборі меблів, які ідеально підходять саме вам.',
				image: '/Advantages/Professional.svg',
			},
		],
	},
	categories: {
		title: 'Популярні категорії',
		data: [
			{ title: 'Кухні', linkId: 44, image: '/Categories/Cat1.jpg' },
			{ title: 'Шафи', linkId: 39, image: '/Categories/Cat2.jpg' },
			{ title: 'Столи', linkId: 33, image: '/Categories/Cat3.jpg' },
			{ title: 'Ліжка', linkId: 1, image: '/Categories/Cat4.jpg' },
			{ title: 'Дивани', linkId: 4, image: '/Categories/Cat6.jpg' },
			{ title: 'Комоди і тумби', linkId: 17, image: '/Categories/Cat5.jpg' },
		],
	},
	hero: {
		sidebar: [
			{
				id: 4,
				text: 'Дивани',
				icon: '/icons/sofas.svg',
			},
			{
				id: 1,
				text: 'Ліжка',
				icon: '/icons/beds.svg',
			},
			{
				id: 11,
				text: 'Крісла',
				icon: '/icons/soft-furniture.svg',
			},
			{
				id: 17,
				text: 'Комоди і тумби',
				icon: '/icons/chests-of-drawers-and-cabinets.svg',
			},
			{
				id: 22,
				text: 'Стільці і табурети',
				icon: '/icons/office.svg',
			},
			{
				id: 27,
				text: 'Матраци та аксесуари',
				icon: '/icons/mattresses.svg',
			},
			{
				id: 33,
				text: 'Столи',
				icon: '/icons/table.svg',
			},
			{
				id: 39,
				text: 'Шкафи та полиці',
				icon: '/icons/cabinets.svg',
			},
			{
				id: 44,
				text: 'Кухні',
				icon: '/icons/cusine.svg',
			},
			{
				id: 48,
				text: 'Стінки і гарнітури',
				icon: '/icons/walls-and-headsets.svg',
			},
		],
		slider: [
			{
				text: 'Купуйте будь-яке крісло або диван і отримайте подушку у подарунок ',
				imgSrc: '/delete/slide.jpg',
			},
			{
				text: 'Купуйте будь-яке крісло або диван і отримайте подушку у подарунок',
				imgSrc: '/delete/slide.jpg',
			},
			{
				text: 'Купуйте будь-яке крісло або диван і отримайте подушку у подарунок',
				imgSrc: '/delete/slide.jpg',
			},
			{
				text: 'Купуйте будь-яке крісло або диван і отримайте подушку у подарунок',
				imgSrc: '/delete/slide.jpg',
			},
			{
				text: 'Купуйте будь-яке крісло або диван і отримайте подушку у подарунок',
				imgSrc: '/delete/slide.jpg',
			},
		],
	},
	newProduct: { title: 'Нові товари' },
	interesrProduct: { title: 'Також вас може зацікавити' },
}

export const ad = [
	{
		text: 'Акція! З 15 по 24 липня на групи комодів, тумб взуття та передпокої!',
	},
	{
		text: 'Акція! З 15 по 24 липня на групи комодів, тумб взуття та передпокої!',
	},
	{
		text: 'Акція! З 15 по 24 липня на групи комодів, тумб взуття та передпокої!',
	},
]
export const header = [
	{ text: 'Каталог' },
	{ text: 'Кошик' },
	{
		text: 'Магазини',
		magazine: [
			{
				town: 'м.Балта, Одеська обл.',
				address: 'вул. Любомирська, 163',
				time: 'ПН - СБ 08:00 - 18:00 НД 08:00 - 16:00',
			},
			{
				town: 'м.Подільск, Одеська обл.',
				address: 'вул. Соборна, 194',
				time: 'ПН - СБ 10:00 - 20:00',
			},
			{
				town: 'м.Одеса',
				address: 'вул. Чорноморського козацтва, 1 А',
				time: 'ПН - НД 08:00 - 18:00 НД 08:00 - 16:00',
			},
			{
				town: 'м.Первомайськ, Миколаївська обл.',
				address: 'вул. Одеська, 48 А',
				time: 'ПН - НД 09:00 - 18:00 ',
			},
		],
	},
	{
		text: 'Контактні телефони',
		contact: [{ link: 'tel:+380951277643', tel: '095-12-77-643' }],
	},
	{
		text: 'Мова',
		lang: [
			{ value: 'ua', text: 'UA' },
			{ value: 'ru', text: 'RU' },
		],
	},
	{ text: 'Пошук...' },
]
export const footer = [
	{
		title: 'Контакти:',
		contacts: [
			{
				title: 'Відділ продажу',
				text: '+38 (095) 127 76 43',
				link: 'tel:+380951277643',
			},
			{
				title: 'Режим роботи',
				text: '08:00 - 18:00 ПН - СБ 08:00 - 16:00 ВС',
			},
			{
				title: 'Зворотній зв’язок',
				text: 'info@tera-mebly.com',
				link: 'mailto:info@tera-mebly.com',
			},
		],
	},
	{
		title: 'Інформація:',
		info: [
			{ text: 'Про нас', link: '/about' },
			{ text: 'Доставка і Оплата', link: '/delivery' },
			{ text: 'Гарантія та Повернення', link: '/warranty' },
		],
	},
	{
		title: 'Ми у соцмережах:',
		socials: [
			{
				icon: FaFacebook,
				link: 'https://www.facebook.com/profile.php?id=61553919922208',
			},
			{
				icon: FaInstagram,
				link: 'https://www.instagram.com/balta.mebli_fortecia/',
			},
			{ icon: FaTiktok, link: 'https://www.tiktok.com/@mebli.balta' },
			{ icon: FaYoutube, link: '/' },
		],
	},
]

export const warranty = [
	{
		title: 'Гарантія та Повернення',
		content: [
			"Усі товари в нашому магазині мають офіційну гарантію від виробника. Гарантійний термін для меблів, придбаних у нас, становить від 12 місяців, залежно від політики виробника. Підтвердження гарантійних зобов'язань послуг гарантійний талон виробника або гарантійний талон від інтернет-магазину «Тера Меблі»",
			'Покупець повинен перевірити цілісність скла та дзеркала при отриманні меблів. У разі пошкодження упаковки слід перевірити кількість і комплектність вкладень.Гарантійне обслуговування меблів діє, якщо меблі зібрані майстрами мебельного магазину «Тера Меблі»',
		],
	},
	{
		title: 'При самостійній збірці',
		content: [
			'Якщо покупець самостійно збирає меблі, необхідно перевірити всі деталі на наявність дефектів (відколів, подряпин). У разі виявлення дефекту слід негайно призупинити збірку, остання частина меблів зі слідами збірки не підлягає поверненню або обміну. Зберігайте фабричну упаковку до завершення збірки, заміна дефектних деталей здійснюється тільки для наявності фабричної упаковки.',
			"Гарантія анулюється, якщо деталь уже була встановлена, або є явні ознаки її використання, наприклад, вкручений гвинт чи прорізане відвір. У разі виявлення дефекту зв'яжіться з менеджером магазину. Зберігайте товарний чек, супровідний документ та маркувальний лист на упаковці до завершення гарантійного терміну.",
			'Рекламація приймається лише за наявність виробу або його елементів в «оригінальній упаковці». У разі недотримання цих вимог, претензії щодо рекламацій не приймаються. Рекламації, які виникли через неправильну збірку, доставку або експлуатацію, усуваються за рахунок покупця. Термін виготовлення рекламних деталей становить близько 20 робочих днів, але в деяких виробників вдається досягти 30 робочих днів.',
			"Гарантійні зобов'язання <span className='font-semibold'>не</span> розширюються, якщо:",
			[
				'порушено правила та умови експлуатації меблів;',
				'встановлення та ремонт меблів використовувалися покупцем самостійно;',
				'меблі пошкоджені внаслідок дії домашніх тварин, вогню, агресивних рідин, а також ознак недбалого поводження з товаром;',
				'змінена конструкція виробу або його комплектуючих покупцем;',
				'завершився гарантійний термін;',
				'є дефекти, про які було повідомлено покупця до продажу, та за наявність яких було надано знижку.',
			],
		],
	},
	{
		title: 'Повернення товару',
		content: [
			'Покупець має право протягом 14 днів обмінюватися на аналогічний або	повернути отриманий товар (меблі), якщо він не підходить за формою, 	кольором, розміром або з інших причин, які заважають використанню	його за призначенням.',
			'Обмін товару або повернення коштів можливе за умов:',
			[
				'товар не використовувався і не збиралося;',
				'збережений товарний вигляд, споживчі властивості, фабричні ярлики;',
				'упаковка не пошкоджена;',
				'є товарний чек, виданий разом з товаром.',
			],
			'Вам буде відмовлено в заміні товару або коштів, якщо:',
			[
				'товар виготовлено під індивідуальне замовлення (зокрема, з обраною	тканиною, нестандартними розмірами, кольорами тощо);',
				'з моменту отримання товару минуло більше 14 днів;',
				'товар не є новим, тобто був зібраний;',
				'при перевірці якості перевірено ознаки стороннього вручення (збірка, монтаж, пошкодження або пошкодження оригінальної упаковки).',
			],
			'У разі відмови від замовлення покупець сплачує вартість доставки в	обидва боки.',
		],
	},
]

export const payment = {
	title: 'Оплата',
	data: [
		{
			title: 'У наших магазинах (готівкою / карткою)',
			content: [
				[
					'Готівка в касу магазину;',
					'Оплата карткою через POS термінал;',
					'Оплата готівкою чи карткою при накладному платежі, під час отримання товару на поштовому відділенні;',
					'Комісію за банківський переказ або витрати, пов’язані з пересиланням післяплати кур’єрською службою (Нова Пошта), оплачує покупець.',
				],
			],
		},
		{
			title: 'За банківськими реквізитами',
			content: [
				[
					'Ви отримуєте рахунок-фактуру, згідно з яким можна оплатити замовлення через будь-який банк.',
				],
			],
		},
		{
			title: 'Через термінал самообслуговування',
			content: [
				['Приватбанк або IBox, за реквізитами наданими нашим Менеджером'],
			],
		},
		{
			title: 'Кредит і розстрочка',
			content: [['Оплата частинами від ПриватБанк', 'Кредит ПумбБанк']],
		},
	],
}

export const delivery = {
	title: 'Доставка',
	data: [
		{
			title: '',
			content: [
				"<span className='font-semibold'>Доставка та збирання Меблів</span>, придбаних в наших офлайн магазинах відбувається по домовленості з персоналом магазину, під час якого обговорюються такі моменти:",
				[
					'адреса доставки товару;',
					'час і дата доставки та збирання товару;',
					'уточнюється вартість доставки та збирання товару.',
				],
				'*Ми рекомендуємо доручити збирання меблів нашим професійним збиральникам, які швидко та якісно зберуть Ваші меблі.',
			],
		},
		{
			title: '',
			content: [
				"<span className='font-semibold'>Доставка та збирання Меблів</span>, варіантах:",
				[
					'доставка з нашого офлайн магазину, якщо це територіально можливо (процедура показана в попередньому дописі);',
					'доставка за допомогою поштових служб таких як Нова Пошта – по їх тарифах. Всі умови доставки та збирання меблів узгоджуються з менеджером нашого Інтернет магазину.',
				],
				'*Ми рекомендуємо доручити збирання меблів нашим професійним збиральникам, які швидко та якісно зберуть Ваші меблі.',
			],
		},
	],
}

export const about = {
	title: 'Про нас',
	data: [
		{
			title: '',
			content: [
				'Ласкаво просимо до інтернет-магазину "Тера Меблі" – вашого надійного партнера у світі стильних, якісних та доступних меблів. Наша історія почалася в 2014 році з відкриття першого магазину, і з того часу ми розвивались разом з нашими клієнтами та партнерами. Сьогодні ми пишаємося тим, що маємо магазини, розташовані в містах Балта, Подільск, Первомайськ та Одеса.',
				'Ми співпрацюємо з найкращими виробниками меблів України, що дозволяє нам пропонувати вам широкий асортимент меблів за найвигіднішими цінами. Наші умови роботи гарантують, що ви завжди знайдете у нас саме те, що потрібно для облаштування вашого дому.',
				'<span className=\'font-semibold\'>Чому варто звернути "Тера Меблі"?</span>',
				[
					"<span className='font-semibold'>Якість і надійність:</span> Ми сумлінно відбираємо продукцію, щоб забезпечити вас найкращими меблями, які служитимуть вам довгі роки.",
					"<span className='font-semibold'>Широкий асортимент:</span> У нас ви знайдете меблі на будь-який смак і для будь-якого інтер'єру.",
					"<span className='font-semibold'>Конкурентні ціни:</span> Завдяки прямим поставкам від українських виробників ми можемо запропонувати конкурентні ціни без шкоди якості.",
					"<span className='font-semibold'>Зручне обслуговування:</span> Ми дбаємо про те, щоб процес вибору та покупки меблів був для вас максимально комфортним та приємним.",
				],

				'"Тера Меблі" – це не просто магазин, це місце, де кожен знайде свій ідеальний предмет інтер\'єру. Зробіть свій вибір на користь якості, комфорту та вигідних цін разом із нами!',
			],
		},
	],
}

export const orders = [
	{ label: 'Введіть своє ім’я', placeholder: 'Ім’я', name: 'firstName' },
	{ label: 'Введіть своє прізвище', placeholder: 'Прізвище', name: 'lastName' },
	{
		label: 'Введіть свій номер телефона',
		placeholder: '+380...',
		name: 'phone',
	},
	{
		label: 'Введіть свою електорнну пошту',
		placeholder: 'tera_mebly@gmail.com',
		name: 'email',
	},
	{ label: 'Населений пункт', placeholder: 'Київ', name: 'city' },
	{ label: 'Вулиця', placeholder: 'вул. Шевченка', name: 'street' },
	{ label: 'Будинок', placeholder: '1', name: 'house' },
	{
		label: 'Квартира/ Офіс',
		placeholder: '12',
		name: 'apartment',
		optional: true,
	},
]

export const radioOptions = {
	delivery: [
		{ label: 'Доставка по місту', value: 'cityDelivery' },
		{ label: 'Самовивіз', value: 'pickup' },
		{ label: 'Нова пошта', value: 'novaPoshta' },
		{ label: 'Meest', value: 'meest' },
	],
	payment: [
		{ label: 'Готівкою', value: 'cash' },
		{ label: 'Карткою', value: 'card' },
		{ label: 'Безготівковий розрахунок', value: 'nonCash' },
		{ label: 'Кредит/Розстрочка', value: 'credit' },
	],
}

export const CHARACTERISTICS: { label: string; key: keyof ProductParams }[] = [
	{ label: 'Вид товару', key: 'Приналежність до категорії' },
	{ label: 'Висота (см)', key: 'Габарит.розміри.Висота(см)(сайт)' },
	{ label: 'Довжина(см)', key: 'Габарит.розміри.Довжина(см)(сайт)' },
	{ label: 'Ширина (см)', key: 'Габарит.розміри.Ширина(см)(сайт)' },
	{ label: 'Додатково ліжка', key: 'Додатково ліжка(сайт ліжка)' },
	{ label: 'Матеріал ліжка', key: 'Матеріал ліжка(сайт ліжка)' },
	{ label: 'Ніша для білизни', key: 'Ніша для білизни(сайт ліжка)' },
	{ label: 'Основа під матрац', key: 'Основа під матрац(сайт ліжка)' },
	{ label: 'Підйомний механізм', key: 'Підйомний механізм(сайт ліжка)' },
	{
		label: 'Ширина спального місця (см)',
		key: 'Роз.спал.місц.ширина(см)(сайт)',
	},
	{
		label: 'Довжина спального місця (см)',
		key: 'Розм.спал.місц.Довжина(см)(сайт)',
	},
	{ label: 'Тип ліжка', key: 'Тип ліжка(сайт ліжка)' },
]
